procurementwebsite/app/Controllers/Admin.php

    public function index()
    {
        $userModel = new \App\Models\UserModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUserID);

        $model = new UserModel();
        $downloadModel = new Downloads();
        $productModel = new ProductModel();

        $userNumber['usersNumber'] = $model->countRows();
        $productNumber['productNumber'] = $productModel->countRows();

        $downloadData['downloads'] = $downloadModel->findAll();
        $userdata['users'] = $model->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'
SELECT *
FROM `downloads`
SELECT *
FROM `users`

    public function adminproduct()
    {
        $userModel = new \App\Models\UserModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUserID);
        $data = [
            'title' => 'Product',
            'userInfo' => $userInfo
        ];
        $model = new ProductModel();
        $productdata['producttb'] = $model->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'
SELECT *
FROM `producttb`

    public function adminaddproduct()
    {
        $userModel = new \App\Models\UserModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUserID);
        $data = [
            'title' => 'AddProduct',
            'userInfo' => $userInfo
        ];
        $model = new ProductModel();
        $productdata['producttb'] = $model->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'
SELECT *
FROM `producttb`

    public function adminupdateproduct()
    {
        $userModel = new \App\Models\UserModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUserID);
        $data = [
            'title' => 'UpdateProduct',
            'userInfo' => $userInfo
        ];
        $model = new ProductModel();
        $productdata['producttb'] = $model->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '5'
SELECT *
FROM `producttb`

    public function updateusers()
    {
        $userModel = new \App\Models\UserModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUserID);
        $data = [
            'title' => 'UpdateUser',
            'userInfo' => $userInfo
        ];
        $model = new ProductModel();
        $productdata['producttb'] = $model->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'
SELECT *
FROM `producttb`