procurementwebsite/app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'markbrvaldez@gmail.com'
 LIMIT 1
---
            $email = $email = $_POST['email'];
            $password  = $_POST['password'];
            $usersModel = new \App\Models\UserModel();
            $user_info = $usersModel->where('email', $email)->first();