procurementwebsite/app/Controllers/Auth.php

            $email = $email = $_POST['email'];
            $password  = $_POST['password'];
            $usersModel = new \App\Models\UserModel();
            $user_info = $usersModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'sample@gmail.com'
 LIMIT 1