procurementwebsite/app/Controllers/Dashboard.php

    public function index()
    {
        $userModel = new \App\Models\UserModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUserID);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '3'

    function profile()
    {
        $userModel = new \App\Models\UserModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUserID);

        $CartModel = new CartModel();
        $cartData['cart'] = $CartModel->findAll();

        $CartModel = new CartModel();
        $cartItems = $CartModel->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'
SELECT *
FROM `cart`

    function cart()
    {
        $userModel = new \App\Models\UserModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUserID);

        $CartModel = new CartModel();
        $cartData['cart'] = $CartModel->findAll();

        $CartModel = new CartModel();
        $cartItems = $CartModel->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '8'
SELECT *
FROM `cart`

    function directory()
    {

        $userModel = new \App\Models\UserModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUserID);
        $data = [
            'title' => 'Directory',
            'userInfo' => $userInfo
        ];
        $model = new EmployeeModel();
        $employeedata['employee'] = $model->findAll();
---
SELECT *
FROM `employee`