procurementwebsite/app/Controllers/Product.php

    public function index()
    {

        $userModel = new \App\Models\UserModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUserID);
        $data = [
            'title' => 'Product',
            'userInfo' => $userInfo
        ];
        $model = new ProductModel();
        $productdata['producttb'] = $model->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = 2
SELECT *
FROM `producttb`

    public function productItem($productId)
    {
        $userModel = new \App\Models\UserModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUserID);

        $model = new ProductModel();
        $commentModel = new CommentModel();
        $productdata['producttb'] = $model->findAll();
        $productComment['comments'] = $commentModel->findAll();

        $request = \Config\Services::request();
        $productId = $request->uri->getSegment(3);

        $comments = $commentModel->where('post_id', $productId)->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'
SELECT *
FROM `producttb`
SELECT *
FROM `comments`
SELECT *
FROM `comments`
WHERE `post_id` = '1'

    public function searchProduct()
    {
        $userModel = new \App\Models\UserModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUserID);

        $query = $this->request->getVar('query');
        $data = [
            'title' => 'Product specs',
            'userInfo' => $userInfo,
            'query' => $query
        ];
        $model = new ProductModel();
        $productdata['producttb'] = $model->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '10'
SELECT *
FROM `producttb`

    public function deleteCart($id)
    {
        $userModel = new \App\Models\UserModel();
        $loggedUserID = session()->get('loggedUser');
        $userInfo = $userModel->find($loggedUserID);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'