procurementwebsite/app/Models/CartModel.php

    public function getAllProductPrices()
    {
        $builder = $this->db->table($this->table);
        $builder->select('item_price');
        $query = $builder->get();
---
SELECT `item_price`
FROM `cart`